app/Controllers/Admin/Bus.php

SELECT *
FROM `buses`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `buses`
SELECT *
FROM `users`
WHERE `role` = 'petugas'
AND `bus_id` = '1'
---
    public function index()
    {
        $userModel = new \App\Models\UserModel();
        $search = $this->request->getGet('search');

        if (!empty($search)) {
            $this->busModel->groupStart()
                           ->like('code', $search)
                           ->orLike('name', $search)
                           ->groupEnd();
        }

        // Paginate buses, 10 per page
        $buses = $this->busModel->paginate(10, 'buses');
        $pager = $this->busModel->pager;

        foreach ($buses as &$bus) {
            $bus['officers'] = $userModel->where('role', 'petugas')->where('bus_id', $bus['id'])->findAll();