app/Controllers/Admin/Dashboard.php

    private function buildDashboardData(): array
    {
        // ── 1. TOTAL PENDAPATAN ────────────────────────────────────────────
        $revenue      = $this->paymentModel->where('status', 'success')->selectSum('amount')->first();
        $totalRevenue = (float) ($revenue['amount'] ?? 0);

        // Pendapatan hari ini
        $todayRevenue = $this->paymentModel
            ->where('status', 'success')
            ->where('DATE(paid_at)', date('Y-m-d'))
            ->selectSum('amount')
            ->first();
        $todayRevenue = (float) ($todayRevenue['amount'] ?? 0);

        // ── 2. TIKET DITERBITKAN ───────────────────────────────────────────
        $totalTickets   = $this->ticketModel->countAllResults();
        $boardedTickets = $this->ticketModel->where('status', 'boarded')->countAllResults();
        $activeTickets  = $this->ticketModel->where('status', 'issued')->countAllResults();

        // Booking ringkasan
        $totalBookings   = $this->bookingModel->countAllResults();
        $pendingBookings = $this->bookingModel->where('payment_status', 'pending')->countAllResults();
        $paidBookings    = $this->bookingModel->where('payment_status', 'paid')->countAllResults();
---
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE `status` = 'success'
 LIMIT 1
SELECT SUM(`amount`) AS `amount`
FROM `payments`
WHERE `status` = 'success'
AND DATE(paid_at) = '2026-06-16'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `tickets`
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` = 'boarded'
SELECT COUNT(*) AS `numrows`
FROM `tickets`
WHERE `status` = 'issued'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `payment_status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `payment_status` = 'paid'


        foreach ($schedules as &$s) {
            // Count non-cancelled booked seats per schedule
            $count = $this->bookingSeatModel
                ->join('bookings', 'bookings.id = booking_seats.booking_id')
                ->where('bookings.schedule_id', $s['id'])
                ->where('bookings.booking_status !=', 'cancelled')
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `booking_seats`
JOIN `bookings` ON `bookings`.`id` = `booking_seats`.`booking_id`
WHERE `bookings`.`schedule_id` = '20'
AND `bookings`.`booking_status` != 'cancelled'