app/Controllers/Admin/Officer.php

    public function index()
    {
        $search = $this->request->getGet('search');

        $builder = $this->userModel->where('role', 'petugas');

        if (!empty($search)) {
            $builder->groupStart()
                    ->like('name', $search)
                    ->orLike('email', $search)
                    ->orLike('phone', $search)
                    ->groupEnd();
        }

        // Paginate officers, 10 per page
        $officers = $this->userModel->paginate(10, 'officers');
---
SELECT *
FROM `users`
WHERE `role` = 'petugas'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'petugas'