app/Controllers/Admin/Route.php

    public function index()
    {
        $search = $this->request->getGet('search');

        if (!empty($search)) {
            $this->routeModel->groupStart()
                             ->like('origin', $search)
                             ->orLike('destination', $search)
                             ->groupEnd();
        }

        // Paginate routes, 10 per page
        $routes = $this->routeModel->paginate(10, 'routes');
---
SELECT *
FROM `routes`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `routes`