app/Controllers/Public/LandingPage.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Popular routes
        $routes = $db->table('routes')->select('origin, destination, MIN(schedules.price) as min_price')
            ->join('schedules', 'schedules.route_id = routes.id', 'left')
            ->groupBy('routes.origin, routes.destination')
            ->orderBy('min_price', 'ASC')
            ->limit(6)
            ->get()->getResultArray();

        // Stats
        $totalTickets  = $db->table('tickets')->countAllResults();
        $totalRoutes   = $db->table('routes')->countAllResults();
        $totalBuses    = $db->table('buses')->countAllResults();

        // Active promos
        $promos = $db->table('promos')
            ->where('valid_from <=', date('Y-m-d'))
            ->where('valid_until >=', date('Y-m-d'))
            ->limit(3)
            ->get()->getResultArray();

        // Recent positive reviews
        $reviews = $db->table('reviews')
            ->select('reviews.*, users.name as user_name')
            ->join('users', 'users.id = reviews.user_id')
            ->where('reviews.sentiment', 'positive')
            ->where('reviews.rating >=', 4)
            ->orderBy('reviews.created_at', 'DESC')
            ->limit(4)
            ->get()->getResultArray();

        // Cities list for search dropdown
        $origins = $db->table('routes')->distinct()->select('origin')->get()->getResultArray();
        $destinations = $db->table('routes')->distinct()->select('destination')->get()->getResultArray();
---
SELECT `origin`, `destination`, MIN(schedules.price) as min_price
FROM `routes`
LEFT JOIN `schedules` ON `schedules`.`route_id` = `routes`.`id`
GROUP BY `routes`.`origin`, `routes`.`destination`
ORDER BY `min_price` ASC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `tickets`
SELECT COUNT(*) AS `numrows`
FROM `routes`
SELECT COUNT(*) AS `numrows`
FROM `buses`
SELECT *
FROM `promos`
WHERE `valid_from` <= '2026-06-16'
AND `valid_until` >= '2026-06-16'
 LIMIT 3
SELECT `reviews`.*, `users`.`name` as `user_name`
FROM `reviews`
JOIN `users` ON `users`.`id` = `reviews`.`user_id`
WHERE `reviews`.`sentiment` = 'positive'
AND `reviews`.`rating` >= 4
ORDER BY `reviews`.`created_at` DESC
 LIMIT 4
SELECT DISTINCT `origin`
FROM `routes`
SELECT DISTINCT `destination`
FROM `routes`