app/Models/ScheduleModel.php

    public function getDetailedSchedules($id = null)
    {
        $builder = $this->select('schedules.*, routes.origin, routes.destination, routes.distance_km, routes.estimated_duration, buses.name as bus_name, buses.type as bus_type, buses.total_seats, buses.seat_layout')
            ->join('routes', 'routes.id = schedules.route_id')
            ->join('buses', 'buses.id = schedules.bus_id');

        if ($id !== null) {
            return $builder->where('schedules.id', $id)->first();
        }

        return $builder->findAll();
---
SELECT `schedules`.*, `routes`.`origin`, `routes`.`destination`, `routes`.`distance_km`, `routes`.`estimated_duration`, `buses`.`name` as `bus_name`, `buses`.`type` as `bus_type`, `buses`.`total_seats`, `buses`.`seat_layout`
FROM `schedules`
JOIN `routes` ON `routes`.`id` = `schedules`.`route_id`
JOIN `buses` ON `buses`.`id` = `schedules`.`bus_id`